; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v6 - type_2 ?v8 - type_1)
 	      (pred_3 ?v2 - object ?v8 - type_1)
	      (pred_1 ?v6 - type_2 ?v3 - type_3)
	      (pred_2 ?v6 - type_2 ?v2 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v6 - type_2 ?v7 ?v1 - type_1)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v1)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_2 ?v4 - object ?v5 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v5) (pred_4 ?v6 ?v5) (pred_1 ?v6 ?v3))
       :effect (and (pred_2 ?v6 ?v4 ?v3)
		    (not (pred_3 ?v4 ?v5)) 
		    (not (pred_1 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_2 ?v4 - object ?v5 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v4 ?v3) (pred_4 ?v6 ?v5))
       :effect (and (pred_3 ?v4 ?v5)
		    (pred_1 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v4 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_12 - type_2
obj_03 obj_08 obj_09 obj_10 - type_3
obj_13 obj_06 obj_05 obj_01 - type_1
obj_14 obj_04 obj_02 obj_11 - object)
(:init
(pred_4 obj_07 obj_06)
(pred_1 obj_07 obj_03)
(pred_1 obj_07 obj_08)
(pred_4 obj_12 obj_05)
(pred_1 obj_12 obj_09)
(pred_1 obj_12 obj_10)
(pred_3 obj_14 obj_01)
(pred_3 obj_04 obj_06)
(pred_3 obj_02 obj_13)
(pred_3 obj_11 obj_13)
)
(:goal
(and
(pred_3 obj_14 obj_05)
(pred_3 obj_04 obj_05)
(pred_3 obj_02 obj_06)
(pred_3 obj_11 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_07 obj_05)))
)
)

; plan
1. (op_2 obj_07 obj_04 obj_06 obj_08)
   deleted: (pred_3 obj_04 obj_06) (pred_1 obj_07 obj_08)
   added: (pred_2 obj_07 obj_04 obj_08)
   goals met: 1 of 4
2. (op_3 obj_12 obj_05 obj_13)
   deleted: (pred_4 obj_12 obj_05)
   added: (pred_4 obj_12 obj_13)
   goals met: 1 of 4
3. (op_3 obj_07 obj_06 obj_01)
   deleted: (pred_4 obj_07 obj_06)
   added: (pred_4 obj_07 obj_01)
   goals met: 1 of 4
4. (op_2 obj_12 obj_02 obj_13 obj_10)
   deleted: (pred_3 obj_02 obj_13) (pred_1 obj_12 obj_10)
   added: (pred_2 obj_12 obj_02 obj_10)
   goals met: 1 of 4
5. (op_3 obj_12 obj_13 obj_06)
   deleted: (pred_4 obj_12 obj_13)
   added: (pred_4 obj_12 obj_06)
   goals met: 1 of 4
6. (op_2 obj_07 obj_14 obj_01 obj_03)
   deleted: (pred_3 obj_14 obj_01) (pred_1 obj_07 obj_03)
   added: (pred_2 obj_07 obj_14 obj_03)
   goals met: 1 of 4
7. (op_1 obj_12 obj_02 obj_06 obj_10)
   deleted: (pred_2 obj_12 obj_02 obj_10)
   added: (pred_3 obj_02 obj_06) (pred_1 obj_12 obj_10)
   goals met: 2 of 4
8. (op_1 obj_07 obj_14 obj_01 obj_03)
   deleted: (pred_2 obj_07 obj_14 obj_03)
   added: (pred_3 obj_14 obj_01) (pred_1 obj_07 obj_03)
   goals met: 2 of 4
9. (op_3 obj_12 obj_06 obj_01)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_01)
   goals met: 2 of 4
10. (op_1 obj_07 obj_04 obj_01 obj_08)
   deleted: (pred_2 obj_07 obj_04 obj_08)
   added: (pred_3 obj_04 obj_01) (pred_1 obj_07 obj_08)
   goals met: 2 of 4
11. (op_2 obj_12 obj_04 obj_01 obj_10)
   deleted: (pred_3 obj_04 obj_01) (pred_1 obj_12 obj_10)
   added: (pred_2 obj_12 obj_04 obj_10)
   goals met: 2 of 4
12. (op_3 obj_12 obj_01 obj_05)
   deleted: (pred_4 obj_12 obj_01)
   added: (pred_4 obj_12 obj_05)
   goals met: 2 of 4
13. (op_1 obj_12 obj_04 obj_05 obj_10)
   deleted: (pred_2 obj_12 obj_04 obj_10)
   added: (pred_3 obj_04 obj_05) (pred_1 obj_12 obj_10)
   goals met: 3 of 4
14. (op_3 obj_12 obj_05 obj_01)
   deleted: (pred_4 obj_12 obj_05)
   added: (pred_4 obj_12 obj_01)
   goals met: 3 of 4
15. (op_2 obj_12 obj_14 obj_01 obj_10)
   deleted: (pred_3 obj_14 obj_01) (pred_1 obj_12 obj_10)
   added: (pred_2 obj_12 obj_14 obj_10)
   goals met: 3 of 4
16. (op_3 obj_12 obj_01 obj_05)
   deleted: (pred_4 obj_12 obj_01)
   added: (pred_4 obj_12 obj_05)
   goals met: 3 of 4
17. (op_1 obj_12 obj_14 obj_05 obj_10)
   deleted: (pred_2 obj_12 obj_14 obj_10)
   added: (pred_3 obj_14 obj_05) (pred_1 obj_12 obj_10)
   goals met: 4 of 4
